src/DataProcessors/ИС_АЛИ_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_АЛИ_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_АЛИ_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_АЛИ_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АтрибутАли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Атрибут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеАтрибутаАли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_ЗначенияАтрибутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_НастройкиСопоставленияХарактеристикТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_НастройкиСопоставленияХарактеристикТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Раздел1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Категории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_ВидРеквизитаСопоставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_ВидРеквизитаСопоставления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСвойствоНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитХарактеристикиНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_АЛИ_КатегорииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_АЛИ_КатегорииТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>is_visible</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>parent_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>properties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Атрибут</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_required</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>sku_properties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Атрибут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_АЛИ_Атрибут</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_required</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_АЛИ_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияПолейНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//УстановитьПараметрыПоейКатегорийНаСервере();
	//ЗаполнитьДеревоМетаданных();	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикРеквизит1СОчистка(Элемент, СтандартнаяОбработка)

	//+ ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736	
	//ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	//- ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736

	УдалитьСопоставлениеХарактеристики(Категория, ТекущаяСтрока.АтрибутАли);

	ТекущаяСтрока.Реквизит1С 	 		= Неопределено;
	ТекущаяСтрока.ВидРеквизита1С 		= ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");
	ТекущаяСтрока.ФиксированноеЗначение = Неопределено;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.АтрибутАли, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ЗаполнитьСоответствиеКатегории();
КонецПроцедуры 

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВидРеквизитаСопоставленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры"));
	Если ЕстьВидНоменклатурыУХарактеристики() Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры"));
	КонецЕсли;
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры"));
	
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение"));
	СписокВыбора.Добавить(ПредопределенноеЗначение(
	"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры"));
	
	ДанныеВыбора = СписокВыбора;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВидРеквизитаСопоставленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;

	Если ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитНоменклатуры") Тогда

		МассивЗначений = РеквизитыНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитНоменклатуры") Тогда

		МассивЗначений = ДопРеквизитыНабора();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопСвойствоНоменклатуры") Тогда

		МассивЗначений = ДопСвойстваНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.РеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = РеквизитыХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ДопРеквизитХарактеристикиНоменклатуры") Тогда

		МассивЗначений = НаборыДопРеквизитовХарактеристикиНоменклатуры();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ХарактеристикаНоменклатуры") Тогда

		МассивЗначений = ВидыНоменклатурыХарактеристик();

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ФиксированноеЗначение") Тогда
				
		Возврат;

	ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение(
		"Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ШтрихкодНоменклатуры") Тогда

		//ДобавитьСопоставлениеХарактеристики(
		//		Категория, ТекущаяСтрока.ХарактеристикаOzon, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		//	ТекущаяСтрока.ФиксированноеЗначение);
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидРеквизита1С", ВыбранноеЗначение);

	Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.СоответствиеЗначенийСопоставленоЗначений Тогда

		СтандартнаяОбработка = Ложь;

		ТекущаяСтрока = СоответствиеЗначений.НайтиПоИдентификатору(ВыбраннаяСтрока);

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Или Не ТекущаяСтрока.ТребуетсяСопоставление Тогда
			Возврат;
		КонецЕсли;

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Категория", Категория);
		ПараметрыФормы.Вставить("АтрибутАли", ТекущаяСтрока.АтрибутАли);
		ПараметрыФормы.Вставить("ВидРеквизита1С", ТекущаяСтрока.ВидРеквизита1С);
		ПараметрыФормы.Вставить("Реквизит1С", ТекущаяСтрока.Реквизит1С);
		ПараметрыФормы.Вставить("НаборЗначений", ТекущаяСтрока.НаборЗначений);
		Оповещение = Новый ОписаниеОповещения("ПриЗакрытииФормыСопоставленияЗначений", ЭтотОбъект,
			Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока));

		ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаСопоставленияЗначений", ПараметрыФормы, ЭтотОбъект, , , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ФиксированноеЗначение) Тогда
		ДобавитьСопоставлениеХарактеристики(
				Категория, ТекущаяСтрока.АтрибутАли, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура СоответствиеХарактеристикФиксированноеЗначениеОчистка(Элемент, СтандартнаяОбработка)

	//+ ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736	
	//ТекущаяСтрока = Элементы.СоответствиеХарактеристик.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;
	//- ИнфоСофт Стояк Ю.К. 02.04.2025 УА #97736

	УдалитьСопоставлениеХарактеристики(
		Категория, ТекущаяСтрока.АтрибутАли);
	ТекущаяСтрока.Реквизит1С 	 = Неопределено;
	ТекущаяСтрока.ВидРеквизита1С = ПредопределенноеЗначение("Перечисление.ИС_Ozon_ВидРеквизитаСопоставления.ПустаяСсылка");

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура Добавить(Команда)	
	ДобавитьНаСервере();
	Элементы.СоответствиеРеквизитов.Обновить();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьДеревоМетаданных() 

	КоллекцииОбъектовМетаданных = Новый Массив;
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.Справочники);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.РегистрыСведений);
	
	ДеревоМетаданныхЗначение = РеквизитФормыВЗначение("ДеревоМетаданных");
	
	ПрефиксУдаляемыхОбъектов = "удалить";
	УдаляемыеОбъекты = Новый СписокЗначений;
	
	Для Каждого КоллекцияОбъектовМетаданных Из КоллекцииОбъектовМетаданных Цикл
		
		Если КоллекцияОбъектовМетаданных.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
	
		СтрокаМетаданные = ДеревоМетаданныхЗначение.Строки.Добавить();
		
		ИмяМетаданных = КоллекцияОбъектовМетаданных[0].ПолноеИмя();
		КолвоСимволов = СтрНайти(ИмяМетаданных, ".");
		НазваниеМетаданных = Лев(ИмяМетаданных, КолвоСимволов - 1);
		
		СоответствиеНаименованийМетаданных = ПолучитьСоответствиеИменМетаданных();
		СинонимМетаданных = СоответствиеНаименованийМетаданных.Получить(НазваниеМетаданных);
		
		СтрокаМетаданные.Метаданные = НазваниеМетаданных;
		СтрокаМетаданные.ПолноеИмя = СинонимМетаданных;
		СтрокаМетаданные.Синоним = СинонимМетаданных;
		
		Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
			
			Если НазваниеМетаданных = "Справочник" Или НазваниеМетаданных = "ПланВидовХарактеристик" Тогда
				
				Если ОбъектМетаданных.Имя = "Номенклатура" Или ОбъектМетаданных.Имя = "ДополнительныеРеквизитыИСведения" Или ОбъектМетаданных.Имя = "ХарактеристикиНоменклатуры" Тогда
			
					СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
					СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
					СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
					СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
			
				// не у всех метаданных есть владельцы
				//ИначеЕсли ОбъектМетаданных.Владельцы.Количество() > 0 Тогда
				//
				//	Для Каждого Владелец Из ОбъектМетаданных.Владельцы Цикл
				//		
				//		Если Владелец.Имя = "Номенклатура" Тогда
				//			
				//			СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
				//			СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
				//			СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
				//			СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
				//			Прервать;
				//			
				//		КонецЕсли;
				//	
				//	КонецЦикла; 
								
				Иначе
					Продолжить;
				КонецЕсли;	
			
			Иначе
			
				Если СтрНачинаетсяС(НРег(ОбъектМетаданных.Имя), ПрефиксУдаляемыхОбъектов) Тогда
					Продолжить;
				КонецЕсли;
				
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
				
				Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл					
				
					Если Измерение.Тип = Новый ОписаниеТипов(МассивТипов) Тогда
				
						СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
						СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
						СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
						СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
						Прервать;
				
					КонецЕсли;
				
				КонецЦикла;
				
				Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
					
					Если Ресурс.Тип = Новый ОписаниеТипов(МассивТипов) Тогда
						
						Если Не (СтрокаМетаданные.Строки.Найти(ОбъектМетаданных.Имя, "Метаданные") = Неопределено) Тогда
							Продолжить;
						КонецЕсли;
						
						СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
						СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
						СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
						СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
						Прервать;
					
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоМетаданныхЗначение, "ДеревоМетаданных");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервереБезКонтекста
Функция ПолучитьСоответствиеИменМетаданных()

	СоответствиеНаименованийМетаданных = Новый Соответствие;
	СоответствиеНаименованийМетаданных.Вставить("Справочник", "Справочник");
	СоответствиеНаименованийМетаданных.Вставить("ПланВидовХарактеристик", "План видов характеристик");
	СоответствиеНаименованийМетаданных.Вставить("РегистрСведений", "Регистр сведений");
	
	Возврат СоответствиеНаименованийМетаданных;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ЗаполнитьСоответствиеКатегории()
	//ПоляКатегорий.Параметры.УстановитьЗначениеПараметра("Ссылка", Категория);
	
	СоответствиеЗначений.Очистить();
	Если Не ЗначениеЗаполнено(Категория) Тогда
		Возврат;
	КонецЕсли;

	СоответствиеРеквизитовНоменклатуры =  ИС_Ozon_Сервер.СоответствиеРеквизитовНоменклатуры();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИС_АЛИ_КатегорииТоваровХарактеристики.Атрибут КАК АтрибутАли,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С КАК Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С КАК ВидРеквизита1С,
	|	ИСТИНА КАК ТребуетсяСопоставление,
	|	ИС_АЛИ_КатегорииТоваровХарактеристики.is_required КАК Обязательная,
	|	ИС_АЛИ_Атрибут.is_multi_select КАК НаборЗначений,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	Справочник.ИС_АЛИ_КатегорииТоваров.properties КАК ИС_АЛИ_КатегорииТоваровХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначенийХарактеристик
	|		ПО ИС_АЛИ_КатегорииТоваровХарактеристики.Атрибут = ИС_АЛИ_СоответствиеЗначенийХарактеристик.АтрибутАли
	|			И ИС_АЛИ_КатегорииТоваровХарактеристики.Ссылка = ИС_АЛИ_СоответствиеЗначенийХарактеристик.Категория
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_Атрибут
	|		ПО ИС_АЛИ_КатегорииТоваровХарактеристики.Атрибут = ИС_АЛИ_Атрибут.Ссылка
	|ГДЕ
	|	ИС_АЛИ_КатегорииТоваровХарактеристики.Ссылка = &Категория
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_АЛИ_КатегорииТоваровХарактеристики.Атрибут,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ВидРеквизита1С,
	|	ИС_АЛИ_КатегорииТоваровХарактеристики.is_required,
	|	ИС_АЛИ_Атрибут.is_multi_select,
	|	ИС_АЛИ_СоответствиеЗначенийХарактеристик.ФиксированноеЗначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//+ ИнфоСофт Заварин К.В. 16.04.25 УА #98618
	//|ВЫБРАТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//- ИнфоСофт Заварин К.В. 16.04.25 УА #98618
	|	ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.Атрибут,
	|	ИС_АЛИ_СоответствиеЗначений.Реквизит1С,
	|	ИС_АЛИ_СоответствиеЗначений.ВидРеквизита1С,
	|	ИСТИНА,
	|	ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.is_required,
	|	ИС_АЛИ_АтрибутРазмер.is_multi_select,
	|	ИС_АЛИ_СоответствиеЗначений.ФиксированноеЗначение
	|ИЗ
	|	Справочник.ИС_АЛИ_КатегорииТоваров.sku_properties КАК ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеЗначенийХарактеристик КАК ИС_АЛИ_СоответствиеЗначений
	|		ПО ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.Атрибут = ИС_АЛИ_СоответствиеЗначений.АтрибутАли
	|			И ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.Ссылка = ИС_АЛИ_СоответствиеЗначений.Категория
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_АЛИ_Атрибут КАК ИС_АЛИ_АтрибутРазмер
	|		ПО ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.Атрибут = ИС_АЛИ_АтрибутРазмер.Ссылка
	|ГДЕ
	|	ИС_АЛИ_КатегорииТоваровХарактеристикиРазмер.Ссылка = &Категория
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обязательная УБЫВ";

	Запрос.УстановитьПараметр("Категория", Категория);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = СоответствиеЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
		
		НоваяСтрока.СопоставленоЗначений = ИС_АЛИ_Сервер.ТекстКоличествоСопоставленныхЗначений(
				Категория, НоваяСтрока.АтрибутАли, НоваяСтрока.ВидРеквизита1С, НоваяСтрока.Реквизит1С,
			НоваяСтрока.ТребуетсяСопоставление);

	КонецЦикла;  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Функция СформироватьДанныеВыбора()
	                
	ЗначенияВыбора = Новый СписокЗначений;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Раздел1С);
	
	Если СтрНайти(Раздел1С, "Справочник") <> 0 Тогда
		          
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			ЗначенияВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);	
		КонецЦикла;
		
		ЗначенияВыбора.Добавить("Наименование", "Наименование");
		ЗначенияВыбора.Добавить("Код", "Код");
	
	ИначеЕсли СтрНайти(Раздел1С, "ПланВидовХарактеристик") <> 0 Тогда
		ЗаполнитьСвойствамиНоменклатуры(ЗначенияВыбора);
		ЗаполнитьСвойствамиХарактеристики(ЗначенияВыбора);
	Иначе
		
		Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
			ЗначенияВыбора.Добавить(Измерение.Имя, Измерение.Синоним);	
		КонецЦикла;	
		
		Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
			ЗначенияВыбора.Добавить(Ресурс.Имя, Ресурс.Синоним);	
		КонецЦикла;	

	КонецЕсли;
	
	ЗначенияВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Возврат ЗначенияВыбора;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьСвойствамиНоменклатуры(ЗначенияВыбора)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство.Имя КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначенияВыбора.Добавить(Выборка.Свойство, Выборка.Заголовок);
	КонецЦикла;
	
КонецПроцедуры

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьСвойствамиХарактеристики(ЗначенияВыбора)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Наименование КАК Свойство,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты";

	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначенияВыбора.Добавить(Выборка.Свойство,Выборка.Заголовок);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ДобавитьНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.ИС_WB_НастройкиСопоставленияХарактеристикТоваров.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Категория = Категория; 
	МенеджерЗаписи.Характеристика = Характеристика; 
	МенеджерЗаписи.Раздел1С = Раздел1С;
	МенеджерЗаписи.Поле1С = Поле1С; 
	МенеджерЗаписи.Записать(); 	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция РеквизитыНоменклатуры()
	Возврат ИС_Ozon_Сервер.РеквизитыНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ДопСвойстваНоменклатуры()
	Возврат ИС_Ozon_Сервер.ДопСвойстваНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры()
	Возврат ИС_Ozon_Сервер.НаборыДопРеквизитовХарактеристикиНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ВидыНоменклатурыХарактеристик()
	Возврат ИС_Ozon_Сервер.ВидыНоменклатурыХарактеристик();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция РеквизитыХарактеристикиНоменклатуры()
	Возврат ИС_Ozon_Сервер.РеквизитыХарактеристикиНоменклатуры();
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ДопРеквизитыНабора(Результат = Неопределено)
	Возврат ИС_Ozon_Сервер.ДопРеквизитыНабора(Результат)
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервереБезКонтекста
Функция ЕстьВидНоменклатурыУХарактеристики()

	Возврат ИС_Ozon_Сервер.ЕстьВидНоменклатурыУХарактеристики();

КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Функция ТекстКоличествоСопоставленныхЗначений(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление)
	Возврат ИС_АЛИ_Сервер.ТекстКоличествоСопоставленныхЗначений(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С, ТребуетсяСопоставление);
КонецФункции //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ВыборРеквизитаДляЗаполнения(Результат, СтруктураПараметров) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.СоответствиеЗначений.ТекущиеДанные;

	Если ТипЗнч(Результат) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидРеквизита1С", СтруктураПараметров.ВидРеквизита1С);

		Оповещение = Новый ОписаниеОповещения("ВыборРеквизитаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);

		МассивЗначений = ДопРеквизитыНабора(Результат);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивЗначений", МассивЗначений);

		ОткрытьФорму("Обработка.ИС_АЛИ_ВыгрузкаКарточекТоваров.Форма.ФормаВыбора", СтруктураПараметров, , , , , Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ТекущаяСтрока.ВидРеквизита1С = СтруктураПараметров.ВидРеквизита1С;
		ТекущаяСтрока.Реквизит1С 	 = Результат;

	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Реквизит1С) Тогда
		ДобавитьСопоставлениеХарактеристики(
			Категория, ТекущаяСтрока.АтрибутАли, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ФиксированноеЗначение);

		ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
			Категория, ТекущаяСтрока.АтрибутАли, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
			ТекущаяСтрока.ТребуетсяСопоставление);
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574   

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаКлиенте
Процедура ПриЗакрытииФормыСопоставленияЗначений(ДанныеПоСопоставленнымЗначениям, ДополнительныеПараметры) Экспорт

	ТекущаяСтрока = СоответствиеЗначений.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.СопоставленоЗначений = ТекстКоличествоСопоставленныхЗначений(
		Категория, ТекущаяСтрока.АтрибутАли, ТекущаяСтрока.ВидРеквизита1С, ТекущаяСтрока.Реквизит1С,
		ТекущаяСтрока.ТребуетсяСопоставление);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура УдалитьСопоставлениеХарактеристики(Категория, АтрибутАли)	
	ИС_АЛИ_Сервер.УдалитьСопоставлениеХарактеристики(Категория, АтрибутАли);
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
&НаСервере
Процедура ДобавитьСопоставлениеХарактеристики(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение)	
	ИС_АЛИ_Сервер.ДобавитьСопоставлениеХарактеристики(Категория, АтрибутАли, ВидРеквизита1С, Реквизит1С, ФиксированноеЗначение); 
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

#КонецОбласти
